export const ValidationMessages = {
    amLetters_space: 'Թույլատրվում է ավելացնել հայկական տառեր, բացատ ու գիծ(-)։',
    description: 'Թույլատրելի է ավելացնել հայերեն տառեր, թվեր, բացատ ու () «» - <> ․ , / սիմվոլները։',
    maxlength: 'Առավելագույն պետք է պարունակի 25 սիմվոլ։',
    maxlengthpasport: 'Առավելագույն պետք է պարունակի 9 սիմվոլ։',
    maxlengtsocialcard: 'Դաշտը պետք է պարունակի 10 թվանշան։',
    phone: 'Դաշտը պետք է լինի (*** ** ** **) ֆորմատով։',
    Wrongformat: 'Սխալ ֆորմատ',
    maxlengthTextArea: 'Առավելագույն պետք է պարունակի 200 սիմվոլ։',
    maxlengthdigits: 'Մուտքագրել թիվ -999 _ 999 միջակայքից',
    enLetters_digits: 'Թույլատրվում է ավելացնել անգլերեն տառեր ու թվեր։',
    enLetters: 'Թույլատրվում է ավելացնել միայն անգլերեն մեծատառ։',
    amEnLetters_digits_symbols_space: 'Թույլատրվում է ավելացնել հայկական, անգլերեն տառեր, թվեր, բացատ ու -.․()`՝ սիմվոլները։',
    pasportsocialSecurityCard: 'Թույլատրվում է ավելացնել միայն 2 մեծատառ և 7 թիվ։',
    only_digits: 'Թույլատրվում է ավելացնել միայն դրական թվեր։',
    length: 'length length length ',
    invalidAge: 'Տարիքը պետք է լինի 18 կամ ավելի մեծ',

    maxlengths(length: number)
    {
        return `Առավելագույնը պետք է պարունակի  ${length} սիմվոլ։`
    },
    minlength(length: number) {
        return `Նվազագույնը պետք է պարունակի  ${length} սիմվոլ։`
    },

    required (fieldName: string): string {
        return `${fieldName} դաշտը պարտադիր դաշտ է։`
    },


    range(min: number, max : number){
        return `Նշել  [${min}-${max}] միջակայքին պատկանող թիվ`;
    },


    letters: 'Թույլատրելի է ավելացնել հայերեն տառեր, բացատ ու գիծ(-) սիմվոլները։',

    REQUIRED : 'Պարտադիր լրացման դաշտ',
    EMAIL: 'Նշված ֆորմատով Էլ․ փոստ գոյություն չունի',
    PHONENUMBER1: 'Հեռախոսահամարը  պարունակում Է 6-20 թվանշան',
    phoneNumber2: 'Հեռախոսահամարը  պարունակում Է 6-20 թվանշան',
    birthNumber: 'Ծննդյան վկայականը պարունակում է հայերեն, ռուսերեն, անգլերեն մեծատառեր ու թվեր',
    certificateNumber: 'Վկայականի համարը արունակում է անգլերեն, ռուսերե մեծատառեր և թվեր, առավելագույնը 15 սիմվոլ',
    desciption: 'Նկարագրությունը պարունակում է հայկական տառեր, թվեր ու ․․․․․․․․․',
    passportNumber: 'Անձնագրիը պարունակում է անգլերեն, ռուսերե մեծատառեր և թվեր, առավելագույնը 15 սիմվոլ',
    fromWho: 'Իրենից ներկայացնում է եռանիշ թիվ',

    PASSWORD_IS_DIGIT: 'Գաղտնաբառը պետք է պարունակի 0-9 թվանշաններից գոնե մեկը։',

    PASSWORD_IS_LOWER: 'Գաղտնաբառը պետք է պարունակի a-z գոնե մեկ  փոքրատառ։',

    PASSWORD_IS_UPPER: 'Գաղտնաբառը պետք է պարունակի A-Z գոնե մեկ  մեծատառ։',

    PASSWORD_IS_LETTER_OR_DIGIT: 'Գաղտնաբառը պետք է պարունակի առնվազն մեկ սիմվոլ։',
    SPACE: 'Գաղտնաբառը չի կարող պարունակել բացատ։',

    USERNAME: 'Ծածկանունը կարող է  պարունակել անգլերեն տառեր _ սիմվոլ և 0-9 թվանշանները:Ծածկանունը միայն տառով կարողա սկսել:',

    USERNAMEISTAKEN: 'Տվյալ ծածկանունը արդեն զբաղված է։',

    PASSWORD: 'Ծածկագիրը պետք է պարունակի առնվազն 8 սիմվոլ,մեկ փոքրատառ,մեկ մեծատառ,0-9 թվանշաններից գոնե մեկը և մեկ հատուկ սիմվոլ։ ',

    CONFIRMPASSWORD: 'Ծածկագրերը չեն համապատասխանում։ ',


    //Aystexic sksvac bolory ogtagorcvum en
    file_required: "Կցեք ֆայլեր",
    file_maxCount: "Ֆայլերի առավելագույն քանակը չի կարող գերազանցել 10-ը",
    file_extension: "Ֆայլերը պետք է լինեն pdf, png, jpg, jpeg ֆորմատով",
    deadNumber: "Պարունակում է հայերեն, ռուսերեն, անգլերեն տառեր ու թվեր, առավելագույնը 15 սիմվոլ"
}